class A { 	// оголошення класу А
  long lx; // член класу lx
  public:  // декларація прав доступу
   int  x;	// член класу x
        // функція-член класу
   int  vFunct(int) {return 1; }
} a;		// створення об'єкта а класу А


int main() {
// доступ до члена а через оператор доступу
   a.x++;

   // доступ до члена через оператор доступу і ОДД
      a.A::x++;
   // організація вказівника на об'єкт класу А
      A* p = &a;
   // доступ до члена через вказівник i оператор ->
      p->x++;
   // доступ до члена через вказівник, -> і ОДД
      p->A::x++;
      A* p2 = new A;
      return 0;
   }
