struct B { 	// оголошення стороннього класу
  int i_B;
};


struct A { 	// оголошення основного класу
  int i_A; 	// член даних класу A
    B b; 		// об'єкт стороннього класу B

  struct C { 	// оголошенння вкладеного класу
   int i_C; 	// член даних вкладеного класу
  } c;
  // D d; - заборонене оголошення
};

struct D {}; // оголошення стороннього класу


int main() {
  A a; A* p = &a;
  // звертання до члена даних об'єкта а
  a.i_A = 1;
  // звертання до члена даних
  // вкладеного об'єкта
  a.c.i_C = 1;
  p->b.i_B = 1;
}
