// Static field 2.cpp: определяет точку входа для консольного приложения.
//

#include "stdafx.h"

class A {
	// закритий cтатичний член класу
	static int x;
public:
	// відкритий cтатичний член класу
	static int y;

	void f(int i) { x = i; } // функція-член класу

							 // дружня функція
	friend void f1(int);
};

// оголошення дружної функції
void f1(int i) {
	A::x = i;
}

// визначення й ініціалізація стат. члена
int A::y = 2;
// доступ через визначення й ініціалізацію
int A::x = 1;

void main() {
	A a;
	a.f(1);// доступ через функцію-член
	f1(1); // доступ через дружню функцію
}