// ClassExample.cpp: определяет точку входа для консольного приложения.
//

#include "stdafx.h"

class A 	// оголошення класу А
{
	long lx; 	// член класу lx
	public:		// декларація прав доступу
		int  x;	// член класу x
		int  vFunct(int) {return 1; }	// функція-член класу vFunct
} a;
int main()
{
		// створення об'єкта а класу А
	a.x++;	// доступ до члена а через оператор доступу
	a.A::x++;	// доступ до члена а через оператор доступу і ОДД
	A* p = &a;	// організація вказівника на об'єкт класу А
	p->x++;	// доступ до члена через вказівник i оператор доступу
	p->A::x++;	// доступ до члена через вказівник,
	A* p2 = new A;
	return 0;
}

