// StaticMethod.cpp: определяет точку входа для консольного приложения.
//

#include "stdafx.h"
class A
{
public:
	int x;

	// стат. функ.-член класу з посиланням
	static int f(A&, int);
	// стат. функ.-член класу з вказівником
	static int f1(A*, int);
};

// визначення стат. функції-члена
int A::f(A& a0, int i)
{
	// заборонені звертання
	//x = i; 
	//this->x = i; 
	//A::x = i; 
	// звертання до члена даних через посилання 
	a0.x = i;
	return 1;
}

// визначення стат. функції-члена
int A::f1(A* a0, int i)
{
	// звертання до члена даних через посилання 
	a0->x = i;
	return 1;
}

void main()
{
	A a;

	// виклик стат. функції через ОДД
	A::f(a, 1);

	// виклик стат. функції через об'єкт
	a.f(a, 2);
	A* p = &a;

	// виклик стат. функції з пар. адресою
	A::f1(&a, 1);

	// виклик стат. функції через вказівник
	p->f1(p, 2);
}
