struct A  {
  int x;
  // стат. функ.-член класу з посиланням
  static void f(A&, int);
  // стат. функ.-член класу з вказівником
  static void f1(A*, int);
};


// визначення стат. функції-члена
void A::f(A& a0, int i) {
 // заборонені звертання
 //x = i;  //this->x = i;  //A::x = i;
 // звертання до члена даних через посилання
 a0.x = i;
}

// визначення стат. функції-члена
void A::f1(A* a0, int i) {
 // звертання до члена даних через посилання
 a0->x = i;
}


int main() {
 A a;
 A::f(a, 1); // виклик стат. функції через ОДД


 a.f(a, 2);  // виклик стат. функції через об'єкт


 A* p = &a;
 // виклик стат. функції з пар. адресою
 A::f1(&a, 1);


 // виклик стат. функції через вказівник
 p->f1(p, 2);
}
