// Embedded class.cpp: определяет точку входа для консольного приложения.
//

#include "stdafx.h"
// оголошення зовнішнього класу
class A { 
	//оголошення вкладеного порожнього класу
	class C {};
public:
	// оголошення вкладеного класу
	struct B {
		A* pA;
		int i;
		static int z;
	};

	int j;// члени класу A
	void f();
};

int A::B::z;

// тіло функції-члена зовнішнього класу А
void A::f() {
	// коректний доступ в тілі функції f до B
	B* pB = new B;
	// немає доступу до членів класу В
	// i=0; B::i=0;
	// коректний доступ до членів В через
	pB->i = 0;
	j = 1;
	// доступ через вказівник з вкладеного класу
	// до членів зовнішнього класу
	pB->pA = this;
	pB->pA->j = 1;
}

void main() {
	A a;
	// доступ до членів об'єкта а є коректним
	a.f(); a.j = 0;
	//a.i=0; немає прямого доступу
	// коректне створення об'єкта вкладеного класу
	A::B b;
	b.i = 0;
	//b.j=1; немає прямого доступу
	
	// доступ через об'єкт вкладеного класу до
	// членів зовнішнього класу
	// b.pA->j = 2; // немає об'єкта
	b.pA = new A;
	b.pA->j = 2; // немає об'єкта
	//A::C c; немає прямого доступу
}

