// Object as Class field.cpp: определяет точку входа для консольного приложения.
//

#include "stdafx.h"
// оголошення стороннього класу
struct B {
	int i_B;
};

// оголошення основного класу
struct A {
	// член даних класу A
	int i_A;
	// об'єкт класу B оголош. за межами A
	B b;
	// клас оголошується вкладеним в клас A
	struct C 	{
			// член даних вкладеного класу
		int i_C;
	} c;
	// D d; - заборонене оголошення
};

struct D {	// оголошення стороннього класу
	int i_D;
};

void main()
{
	A a; A* p = &a;
	// звертання до члена даних об'єкта а
	a.i_A = 1;
	// звертання до члена даних 
	// вкладеного об'єкта
	a.c.i_C = 1;
	p->b.i_B = 1;
}
